<?php
// +----------------------------------------------------------------------
// | 快速开发前后端分离管理后台（PHP版）
// +----------------------------------------------------------------------
// | 欢迎阅读学习系统程序代码，建议反馈是我们前进的动力
// | 开源版本可自由商用，可去除界面版权logo
// | gitee下载：
// | github下载：

// | imadmin团队 版权所有 拥有最终解释权
// +----------------------------------------------------------------------
// | author: imadmin
// +----------------------------------------------------------------------

namespace app\common\enum;


class FileEnum
{
    // 图片类型
    const IMAGE_TYPE = 10;  // 图片类型
    const VIDEO_TYPE = 20;  // 视频类型
    const FILE_TYPE = 30;  // 文件类型


    // 图片来源
    const SOURCE_ADMIN = 0;  // 后台
    const SOURCE_USER = 1;   // 用户

}
